Repository: yoandresaav/cubavadis
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: Spanish
es: Español

source: English
es: Inglés

source: Home
es: Inicio

source: About
es: Nosotros

source: Pages
es: Páginas

source: Gallery
es: Fotos

source: Blog
es: Noticias

source: Contacts
es: Contáctanos

source: All Rights Reserved
es: Todos los Derechos Reservados

source: Privacy Policy
es: Política de Privacidad

source: Terms of Use
es: Términos de Uso

source: Learn More About CubaVadis
es: Aprenda más sobre CubaVadis

source: Traveling. Tours. Adventure.
es: Viajes. Excursiones. Aventuras.

source: We are committed to offering travel services of the highest quality, combining our energy and enthusiasm, with our years of experience. Our greatest satisfaction comes in serving large numbers of satisfied clients who have experienced the joys and inspiration of travel.
es: Estamos comprometidos a ofrecer servicios de viaje de la más alta calidad, combinando nuestra energía y entusiasmo con nuestros años de experiencia. Nuestra mayor satisfacción es servir a un gran número de clientes satisfechos que han experimentado las alegrías y la inspiración de los viajes.

source: Our Team
es: Nuestro Equipo

source: An experienced team of people passionate about traveling
es: Un experimentado equipo de personas apasionadas por los viajes.

source: View FULL INFO
es: Ver información completa

source: View More
es: Ver más

source: Let`s keep in touch!
es: ¡Mantengámonos en contacto!

source: Contact Our Agency
es: Póngase en contacto con nuestra agencia

source: You can contact us any way that is convenient for you. We are available 24/7 via fax, email or telephone. You can also use a quick contact form on the right or visit our office personally. Email us with any questions or inquiries or use our contact data. We would be happy to answer your questions.
es: Puede contactarnos de cualquier manera que sea conveniente para usted. Estamos disponibles 24/7 a través de fax, correo electrónico o teléfono. También puede usar un formulario de contacto rápido a la derecha o visitar nuestra oficina personalmente. Envíenos un correo electrónico con cualquier pregunta o consulta o utilice nuestros datos de contacto. Estaremos encantados de responder a sus preguntas.

source: To travel is to Live
es: Viajar es Vivir

source: Best Tours & Travel specializes in making your trip an absolute success.
es: CubaVadis se especializa en hacer de su viaje un éxito absoluto.

source: What Our Clients Say
es: Qué dicen nuestros clientes

source: Our clients' testimonials are the best proof of our high level of service
es: Los testimonios de nuestros clientes son la mejor prueba de nuestro alto nivel de servicio

source: Why us?
es: ¿Porque nosotros?

source: The Best Service
es: El mejor servicio

source: Our aim is to provide you with the tour service of the top quality
es: Nuestro objetivo es brindarle el servicio de tours de la mejor calidad.

source: Everything is Included
es: Todo esta incluido

source: There are dozens of aspects to pay attention to, while organizing a trip
es: Hay docenas de aspectos a los que se debe prestar atención al organizar un viaje.

source: Great Prices
es: Precios grandiosos

source: All our tours and excursions are available at really affordable prices
es: Todos nuestros tours y excursiones están disponibles a precios realmente accesibles.

source: Our travel agents are always there to support you during your trip.
es: Nuestros agentes de viajes siempre están ahí para ayudarlo durante su viaje.

source: Handpicked Hotels
es: Hoteles Seleccionados

source: We pick the hotels with the utmost reputation and positive reviews
es: Escogemos los hoteles con mayor reputación y críticas positivas.

source: highly qualified service
es: servicio altamente calificado

source: Our high level of service is officially recognized by thousands of clients
es: Nuestro alto nivel de servicio está oficialmente reconocido por miles de clientes.

source: Happy Clients
es: Clientes Felices

source: Amazing Tours
es: Tours Increíbles

source: Questions Answered
es: Preguntas Respondidas

source: Find your flight
es: Encuentra tu vuelo

source: All Tours For You
es: Todos los Tours para ti

source: tours found
es: tours encontrados

source: Popularity
es: Popularidad

source: Newest
es: Lo más nuevo

source: tours/
es: viajes/
